{
    "intents": [
        {
            "tag": "saludo",
            "patterns": ["Hola", "¡Buenos días!", "¿Cómo te encuentras?", "Hola, ¿qué tal?"],
            "responses": ["¡Hola!", "¡Hola! ¡Es un placer verte!", "¡Buenos días! ¿En qué puedo ayudarte?"]
        },
        {
            "tag": "despedida",
            "patterns": ["Adiós", "Hasta luego", "Nos vemos", "Chao"],
            "responses": ["¡Hasta luego!", "¡Adiós! Espero verte pronto.", "¡Nos vemos! Que tengas un buen día."]
        },
        {
            "tag": "ayuda",
            "patterns": ["¿Puedes ayudarme?", "Necesito ayuda", "¿Qué puedes hacer?", "¿Cuál es tu función?"],
            "responses": ["¡Por supuesto! Estoy aquí para ayudarte.", "Claro, estaré encantado de ayudarte.", "Soy un asistente virtual diseñado para asistirte en tus consultas."]
        },
        {
            "tag": "informacion_personal",
            "patterns": ["¿Cuál es tu nombre?", "¿De dónde eres?", "¿Cuál es tu edad?", "¿Tienes familia?"],
            "responses": ["Soy un modelo de lenguaje de inteligencia artificial llamado ChatGPT.", "No tengo una ubicación física, ya que soy un programa informático.", "Como modelo de lenguaje, no tengo una edad real.", "Como modelo de lenguaje, no tengo familia en el sentido tradicional."]
        },
        {
            "tag": "consulta_tiempo",
            "patterns": ["¿Cómo estará el clima mañana?", "Dime el pronóstico del tiempo", "¿Lloverá el fin de semana?", "Hace frío hoy"],
            "responses": ["Lamento informarte que como modelo de lenguaje no puedo proporcionar información en tiempo real. Te sugiero consultar un sitio web de pronóstico del tiempo para obtener datos actualizados.", "No tengo acceso a datos en tiempo real, pero puedes verificar el pronóstico del tiempo en línea para obtener información precisa."]
        },
        {
            "tag": "consulta_viaje",
            "patterns": ["Quiero reservar un vuelo a París", "¿Cuál es el mejor momento para viajar a Tailandia?", "Busco hoteles en Nueva York", "Recomiéndame un lugar para visitar en Italia"],
            "responses": ["Lamento informarte que como modelo de lenguaje no puedo realizar reservas de vuelos o hoteles. Te sugiero utilizar sitios web especializados para buscar vuelos y alojamientos.", "El mejor momento para viajar a un destino puede depender de diversos factores. Te recomiendo buscar información sobre la temporada turística y el clima para tomar una decisión informada.", "Nueva York es una ciudad llena de opciones de alojamiento. Te sugiero buscar hoteles en sitios web de viajes para encontrar el que mejor se ajuste a tus necesidades.", "Italia es un país con muchos lugares interesantes para visitar. Algunos destinos populares incluyen Roma, Florencia, Venecia y Milán."]
        },
        {
            "tag": "tecnologia",
            "patterns": ["¿Cuáles son las últimas novedades tecnológicas?", "Háblame sobre inteligencia artificial", "¿Qué es la computación cuántica?", "Explícame el Internet de las cosas"],
            "responses": ["Las novedades tecnológicas cambian constantemente. Te recomiendo buscar en sitios de noticias tecnológicas para obtener información actualizada.", "La inteligencia artificial es un campo de la informática que busca crear máquinas capaces de aprender y realizar tareas que normalmente requieren inteligencia humana.", "La computación cuántica es una rama de la computación que utiliza las propiedades de la mecánica cuántica para realizar cálculos en formas más eficientes que las computadoras clásicas.", "El Internet de las cosas es una red de objetos físicos que están conectados a internet y pueden intercambiar datos entre sí."]
        }
    ]
}